Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_eic.h
/**
 * \file
 *
 * \brief Component description for EIC
 *
 * Copyright (c) 2014-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */

#ifndef _SAM4L_EIC_COMPONENT_
#define _SAM4L_EIC_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR EIC */
/* ========================================================================== */
/** \addtogroup SAM4L_EIC External Interrupt Controller */
/*@{*/

#define REV_EIC                     0x302

/* -------- EIC_IER : (EIC Offset: 0x000) ( /W 32) Interrupt Enable Register -------- */
#define EIC_IER_OFFSET              0x000        /**< \brief (EIC_IER offset) Interrupt Enable Register */
#define EIC_IER_RESETVALUE          0x00000000   /**< \brief (EIC_IER reset_value) Interrupt Enable Register */

#define EIC_IER_NMI_Pos             0            /**< \brief (EIC_IER) External Non Maskable CPU interrupt */
#define EIC_IER_NMI                 (0x1u << EIC_IER_NMI_Pos)
#define EIC_IER_INT1_Pos            1            /**< \brief (EIC_IER) External Interrupt 1 */
#define EIC_IER_INT1                (0x1u << EIC_IER_INT1_Pos)
#define   EIC_IER_INT1_0            (0x0u <<  1) /**< \brief (EIC_IER) No effect */
#define   EIC_IER_INT1_1            (0x1u <<  1) /**< \brief (EIC_IER) Enable Interrupt. */
#define EIC_IER_INT2_Pos            2            /**< \brief (EIC_IER) External Interrupt 2 */
#define EIC_IER_INT2                (0x1u << EIC_IER_INT2_Pos)
#define   EIC_IER_INT2_0            (0x0u <<  2) /**< \brief (EIC_IER) No effect */
#define   EIC_IER_INT2_1            (0x1u <<  2) /**< \brief (EIC_IER) Enable Interrupt. */
#define EIC_IER_INT3_Pos            3            /**< \brief (EIC_IER) External Interrupt 3 */
#define EIC_IER_INT3                (0x1u << EIC_IER_INT3_Pos)
#define   EIC_IER_INT3_0            (0x0u <<  3) /**< \brief (EIC_IER) No effect */
#define   EIC_IER_INT3_1            (0x1u <<  3) /**< \brief (EIC_IER) Enable Interrupt. */
#define EIC_IER_INT4_Pos            4            /**< \brief (EIC_IER) External Interrupt 4 */
#define EIC_IER_INT4                (0x1u << EIC_IER_INT4_Pos)
#define   EIC_IER_INT4_0            (0x0u <<  4) /**< \brief (EIC_IER) No effect */
#define   EIC_IER_INT4_1            (0x1u <<  4) /**< \brief (EIC_IER) Enable Interrupt. */
#define EIC_IER_INT5_Pos            5            /**< \brief (EIC_IER) External Interrupt 5 */
#define EIC_IER_INT5                (0x1u << EIC_IER_INT5_Pos)
#define EIC_IER_INT6_Pos            6            /**< \brief (EIC_IER) External Interrupt 6 */
#define EIC_IER_INT6                (0x1u << EIC_IER_INT6_Pos)
#define EIC_IER_INT7_Pos            7            /**< \brief (EIC_IER) External Interrupt 7 */
#define EIC_IER_INT7                (0x1u << EIC_IER_INT7_Pos)
#define EIC_IER_INT8_Pos            8            /**< \brief (EIC_IER) External Interrupt 8 */
#define EIC_IER_INT8                (0x1u << EIC_IER_INT8_Pos)
#define EIC_IER_INT9_Pos            9            /**< \brief (EIC_IER) External Interrupt 9 */
#define EIC_IER_INT9                (0x1u << EIC_IER_INT9_Pos)
#define EIC_IER_INT10_Pos           10           /**< \brief (EIC_IER) External Interrupt 10 */
#define EIC_IER_INT10               (0x1u << EIC_IER_INT10_Pos)
#define EIC_IER_INT11_Pos           11           /**< \brief (EIC_IER) External Interrupt 11 */
#define EIC_IER_INT11               (0x1u << EIC_IER_INT11_Pos)
#define EIC_IER_INT12_Pos           12           /**< \brief (EIC_IER) External Interrupt 12 */
#define EIC_IER_INT12               (0x1u << EIC_IER_INT12_Pos)
#define EIC_IER_INT13_Pos           13           /**< \brief (EIC_IER) External Interrupt 13 */
#define EIC_IER_INT13               (0x1u << EIC_IER_INT13_Pos)
#define EIC_IER_INT14_Pos           14           /**< \brief (EIC_IER) External Interrupt 14 */
#define EIC_IER_INT14               (0x1u << EIC_IER_INT14_Pos)
#define EIC_IER_INT15_Pos           15           /**< \brief (EIC_IER) External Interrupt 15 */
#define EIC_IER_INT15               (0x1u << EIC_IER_INT15_Pos)
#define EIC_IER_MASK                0x0000FFFFu  /**< \brief (EIC_IER) MASK Register */

/* -------- EIC_IDR : (EIC Offset: 0x004) ( /W 32) Interrupt Disable Register -------- */
#define EIC_IDR_OFFSET              0x004        /**< \brief (EIC_IDR offset) Interrupt Disable Register */
#define EIC_IDR_RESETVALUE          0x00000000   /**< \brief (EIC_IDR reset_value) Interrupt Disable Register */

#define EIC_IDR_NMI_Pos             0            /**< \brief (EIC_IDR) External Non Maskable CPU interrupt */
#define EIC_IDR_NMI                 (0x1u << EIC_IDR_NMI_Pos)
#define EIC_IDR_INT1_Pos            1            /**< \brief (EIC_IDR) External Interrupt 1 */
#define EIC_IDR_INT1                (0x1u << EIC_IDR_INT1_Pos)
#define   EIC_IDR_INT1_0            (0x0u <<  1) /**< \brief (EIC_IDR) No effect */
#define   EIC_IDR_INT1_1            (0x1u <<  1) /**< \brief (EIC_IDR) Disable Interrupt. */
#define EIC_IDR_INT2_Pos            2            /**< \brief (EIC_IDR) External Interrupt 2 */
#define EIC_IDR_INT2                (0x1u << EIC_IDR_INT2_Pos)
#define   EIC_IDR_INT2_0            (0x0u <<  2) /**< \brief (EIC_IDR) No effect */
#define   EIC_IDR_INT2_1            (0x1u <<  2) /**< \brief (EIC_IDR) Disable Interrupt. */
#define EIC_IDR_INT3_Pos            3            /**< \brief (EIC_IDR) External Interrupt 3 */
#define EIC_IDR_INT3                (0x1u << EIC_IDR_INT3_Pos)
#define   EIC_IDR_INT3_0            (0x0u <<  3) /**< \brief (EIC_IDR) No effect */
#define   EIC_IDR_INT3_1            (0x1u <<  3) /**< \brief (EIC_IDR) Disable Interrupt. */
#define EIC_IDR_INT4_Pos            4            /**< \brief (EIC_IDR) External Interrupt 4 */
#define EIC_IDR_INT4                (0x1u << EIC_IDR_INT4_Pos)
#define   EIC_IDR_INT4_0            (0x0u <<  4) /**< \brief (EIC_IDR) No effect */
#define   EIC_IDR_INT4_1            (0x1u <<  4) /**< \brief (EIC_IDR) Disable Interrupt. */
#define EIC_IDR_INT5_Pos            5            /**< \brief (EIC_IDR) External Interrupt 5 */
#define EIC_IDR_INT5                (0x1u << EIC_IDR_INT5_Pos)
#define EIC_IDR_INT6_Pos            6            /**< \brief (EIC_IDR) External Interrupt 6 */
#define EIC_IDR_INT6                (0x1u << EIC_IDR_INT6_Pos)
#define EIC_IDR_INT7_Pos            7            /**< \brief (EIC_IDR) External Interrupt 7 */
#define EIC_IDR_INT7                (0x1u << EIC_IDR_INT7_Pos)
#define EIC_IDR_INT8_Pos            8            /**< \brief (EIC_IDR) External Interrupt 8 */
#define EIC_IDR_INT8                (0x1u << EIC_IDR_INT8_Pos)
#define EIC_IDR_INT9_Pos            9            /**< \brief (EIC_IDR) External Interrupt 9 */
#define EIC_IDR_INT9                (0x1u << EIC_IDR_INT9_Pos)
#define EIC_IDR_INT10_Pos           10           /**< \brief (EIC_IDR) External Interrupt 10 */
#define EIC_IDR_INT10               (0x1u << EIC_IDR_INT10_Pos)
#define EIC_IDR_INT11_Pos           11           /**< \brief (EIC_IDR) External Interrupt 11 */
#define EIC_IDR_INT11               (0x1u << EIC_IDR_INT11_Pos)
#define EIC_IDR_INT12_Pos           12           /**< \brief (EIC_IDR) External Interrupt 12 */
#define EIC_IDR_INT12               (0x1u << EIC_IDR_INT12_Pos)
#define EIC_IDR_INT13_Pos           13           /**< \brief (EIC_IDR) External Interrupt 13 */
#define EIC_IDR_INT13               (0x1u << EIC_IDR_INT13_Pos)
#define EIC_IDR_INT14_Pos           14           /**< \brief (EIC_IDR) External Interrupt 14 */
#define EIC_IDR_INT14               (0x1u << EIC_IDR_INT14_Pos)
#define EIC_IDR_INT15_Pos           15           /**< \brief (EIC_IDR) External Interrupt 15 */
#define EIC_IDR_INT15               (0x1u << EIC_IDR_INT15_Pos)
#define EIC_IDR_MASK                0x0000FFFFu  /**< \brief (EIC_IDR) MASK Register */

/* -------- EIC_IMR : (EIC Offset: 0x008) (R/  32) Interrupt Mask Register -------- */
#define EIC_IMR_OFFSET              0x008        /**< \brief (EIC_IMR offset) Interrupt Mask Register */
#define EIC_IMR_RESETVALUE          0x00000000   /**< \brief (EIC_IMR reset_value) Interrupt Mask Register */

#define EIC_IMR_NMI_Pos             0            /**< \brief (EIC_IMR) External Non Maskable CPU interrupt */
#define EIC_IMR_NMI                 (0x1u << EIC_IMR_NMI_Pos)
#define EIC_IMR_INT1_Pos            1            /**< \brief (EIC_IMR) External Interrupt 1 */
#define EIC_IMR_INT1                (0x1u << EIC_IMR_INT1_Pos)
#define   EIC_IMR_INT1_0            (0x0u <<  1) /**< \brief (EIC_IMR) Interrupt is disabled */
#define   EIC_IMR_INT1_1            (0x1u <<  1) /**< \brief (EIC_IMR) Interrupt is enabled. */
#define EIC_IMR_INT2_Pos            2            /**< \brief (EIC_IMR) External Interrupt 2 */
#define EIC_IMR_INT2                (0x1u << EIC_IMR_INT2_Pos)
#define   EIC_IMR_INT2_0            (0x0u <<  2) /**< \brief (EIC_IMR) Interrupt is disabled */
#define   EIC_IMR_INT2_1            (0x1u <<  2) /**< \brief (EIC_IMR) Interrupt is enabled. */
#define EIC_IMR_INT3_Pos            3            /**< \brief (EIC_IMR) External Interrupt 3 */
#define EIC_IMR_INT3                (0x1u << EIC_IMR_INT3_Pos)
#define   EIC_IMR_INT3_0            (0x0u <<  3) /**< \brief (EIC_IMR) Interrupt is disabled */
#define   EIC_IMR_INT3_1            (0x1u <<  3) /**< \brief (EIC_IMR) Interrupt is enabled. */
#define EIC_IMR_INT4_Pos            4            /**< \brief (EIC_IMR) External Interrupt 4 */
#define EIC_IMR_INT4                (0x1u << EIC_IMR_INT4_Pos)
#define   EIC_IMR_INT4_0            (0x0u <<  4) /**< \brief (EIC_IMR) Interrupt is disabled */
#define   EIC_IMR_INT4_1            (0x1u <<  4) /**< \brief (EIC_IMR) Interrupt is enabled. */
#define EIC_IMR_INT5_Pos            5            /**< \brief (EIC_IMR) External Interrupt 5 */
#define EIC_IMR_INT5                (0x1u << EIC_IMR_INT5_Pos)
#define EIC_IMR_INT6_Pos            6            /**< \brief (EIC_IMR) External Interrupt 6 */
#define EIC_IMR_INT6                (0x1u << EIC_IMR_INT6_Pos)
#define EIC_IMR_INT7_Pos            7            /**< \brief (EIC_IMR) External Interrupt 7 */
#define EIC_IMR_INT7                (0x1u << EIC_IMR_INT7_Pos)
#define EIC_IMR_INT8_Pos            8            /**< \brief (EIC_IMR) External Interrupt 8 */
#define EIC_IMR_INT8                (0x1u << EIC_IMR_INT8_Pos)
#define EIC_IMR_INT9_Pos            9            /**< \brief (EIC_IMR) External Interrupt 9 */
#define EIC_IMR_INT9                (0x1u << EIC_IMR_INT9_Pos)
#define EIC_IMR_INT10_Pos           10           /**< \brief (EIC_IMR) External Interrupt 10 */
#define EIC_IMR_INT10               (0x1u << EIC_IMR_INT10_Pos)
#define EIC_IMR_INT11_Pos           11           /**< \brief (EIC_IMR) External Interrupt 11 */
#define EIC_IMR_INT11               (0x1u << EIC_IMR_INT11_Pos)
#define EIC_IMR_INT12_Pos           12           /**< \brief (EIC_IMR) External Interrupt 12 */
#define EIC_IMR_INT12               (0x1u << EIC_IMR_INT12_Pos)
#define EIC_IMR_INT13_Pos           13           /**< \brief (EIC_IMR) External Interrupt 13 */
#define EIC_IMR_INT13               (0x1u << EIC_IMR_INT13_Pos)
#define EIC_IMR_INT14_Pos           14           /**< \brief (EIC_IMR) External Interrupt 14 */
#define EIC_IMR_INT14               (0x1u << EIC_IMR_INT14_Pos)
#define EIC_IMR_INT15_Pos           15           /**< \brief (EIC_IMR) External Interrupt 15 */
#define EIC_IMR_INT15               (0x1u << EIC_IMR_INT15_Pos)
#define EIC_IMR_MASK                0x0000FFFFu  /**< \brief (EIC_IMR) MASK Register */

/* -------- EIC_ISR : (EIC Offset: 0x00C) (R/  32) Interrupt Status Register -------- */
#define EIC_ISR_OFFSET              0x00C        /**< \brief (EIC_ISR offset) Interrupt Status Register */
#define EIC_ISR_RESETVALUE          0x00000000   /**< \brief (EIC_ISR reset_value) Interrupt Status Register */

