Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_eic.h
#define EIC_ISR_NMI_Pos             0            /**< \brief (EIC_ISR) External Non Maskable CPU interrupt */
#define EIC_ISR_NMI                 (0x1u << EIC_ISR_NMI_Pos)
#define EIC_ISR_INT1_Pos            1            /**< \brief (EIC_ISR) External Interrupt 1 */
#define EIC_ISR_INT1                (0x1u << EIC_ISR_INT1_Pos)
#define   EIC_ISR_INT1_0            (0x0u <<  1) /**< \brief (EIC_ISR) An interrupt event has not occurred */
#define   EIC_ISR_INT1_1            (0x1u <<  1) /**< \brief (EIC_ISR) An interrupt event has occurred. */
#define EIC_ISR_INT2_Pos            2            /**< \brief (EIC_ISR) External Interrupt 2 */
#define EIC_ISR_INT2                (0x1u << EIC_ISR_INT2_Pos)
#define   EIC_ISR_INT2_0            (0x0u <<  2) /**< \brief (EIC_ISR) An interrupt event has not occurred */
#define   EIC_ISR_INT2_1            (0x1u <<  2) /**< \brief (EIC_ISR) An interrupt event has occurred. */
#define EIC_ISR_INT3_Pos            3            /**< \brief (EIC_ISR) External Interrupt 3 */
#define EIC_ISR_INT3                (0x1u << EIC_ISR_INT3_Pos)
#define   EIC_ISR_INT3_0            (0x0u <<  3) /**< \brief (EIC_ISR) An interrupt event has not occurred */
#define   EIC_ISR_INT3_1            (0x1u <<  3) /**< \brief (EIC_ISR) An interrupt event has occurred. */
#define EIC_ISR_INT4_Pos            4            /**< \brief (EIC_ISR) External Interrupt 4 */
#define EIC_ISR_INT4                (0x1u << EIC_ISR_INT4_Pos)
#define   EIC_ISR_INT4_0            (0x0u <<  4) /**< \brief (EIC_ISR) An interrupt event has not occurred */
#define   EIC_ISR_INT4_1            (0x1u <<  4) /**< \brief (EIC_ISR) An interrupt event has occurred. */
#define EIC_ISR_INT5_Pos            5            /**< \brief (EIC_ISR) External Interrupt 5 */
#define EIC_ISR_INT5                (0x1u << EIC_ISR_INT5_Pos)
#define EIC_ISR_INT6_Pos            6            /**< \brief (EIC_ISR) External Interrupt 6 */
#define EIC_ISR_INT6                (0x1u << EIC_ISR_INT6_Pos)
#define EIC_ISR_INT7_Pos            7            /**< \brief (EIC_ISR) External Interrupt 7 */
#define EIC_ISR_INT7                (0x1u << EIC_ISR_INT7_Pos)
#define EIC_ISR_INT8_Pos            8            /**< \brief (EIC_ISR) External Interrupt 8 */
#define EIC_ISR_INT8                (0x1u << EIC_ISR_INT8_Pos)
#define EIC_ISR_INT9_Pos            9            /**< \brief (EIC_ISR) External Interrupt 9 */
#define EIC_ISR_INT9                (0x1u << EIC_ISR_INT9_Pos)
#define EIC_ISR_INT10_Pos           10           /**< \brief (EIC_ISR) External Interrupt 10 */
#define EIC_ISR_INT10               (0x1u << EIC_ISR_INT10_Pos)
#define EIC_ISR_INT11_Pos           11           /**< \brief (EIC_ISR) External Interrupt 11 */
#define EIC_ISR_INT11               (0x1u << EIC_ISR_INT11_Pos)
#define EIC_ISR_INT12_Pos           12           /**< \brief (EIC_ISR) External Interrupt 12 */
#define EIC_ISR_INT12               (0x1u << EIC_ISR_INT12_Pos)
#define EIC_ISR_INT13_Pos           13           /**< \brief (EIC_ISR) External Interrupt 13 */
#define EIC_ISR_INT13               (0x1u << EIC_ISR_INT13_Pos)
#define EIC_ISR_INT14_Pos           14           /**< \brief (EIC_ISR) External Interrupt 14 */
#define EIC_ISR_INT14               (0x1u << EIC_ISR_INT14_Pos)
#define EIC_ISR_INT15_Pos           15           /**< \brief (EIC_ISR) External Interrupt 15 */
#define EIC_ISR_INT15               (0x1u << EIC_ISR_INT15_Pos)
#define EIC_ISR_MASK                0x0000FFFFu  /**< \brief (EIC_ISR) MASK Register */

/* -------- EIC_ICR : (EIC Offset: 0x010) ( /W 32) Interrupt Clear Register -------- */
#define EIC_ICR_OFFSET              0x010        /**< \brief (EIC_ICR offset) Interrupt Clear Register */
#define EIC_ICR_RESETVALUE          0x00000000   /**< \brief (EIC_ICR reset_value) Interrupt Clear Register */

#define EIC_ICR_NMI_Pos             0            /**< \brief (EIC_ICR) External Non Maskable CPU interrupt */
#define EIC_ICR_NMI                 (0x1u << EIC_ICR_NMI_Pos)
#define EIC_ICR_INT1_Pos            1            /**< \brief (EIC_ICR) External Interrupt 1 */
#define EIC_ICR_INT1                (0x1u << EIC_ICR_INT1_Pos)
#define   EIC_ICR_INT1_0            (0x0u <<  1) /**< \brief (EIC_ICR) No effect */
#define   EIC_ICR_INT1_1            (0x1u <<  1) /**< \brief (EIC_ICR) Clear Interrupt. */
#define EIC_ICR_INT2_Pos            2            /**< \brief (EIC_ICR) External Interrupt 2 */
#define EIC_ICR_INT2                (0x1u << EIC_ICR_INT2_Pos)
#define   EIC_ICR_INT2_0            (0x0u <<  2) /**< \brief (EIC_ICR) No effect */
#define   EIC_ICR_INT2_1            (0x1u <<  2) /**< \brief (EIC_ICR) Clear Interrupt. */
#define EIC_ICR_INT3_Pos            3            /**< \brief (EIC_ICR) External Interrupt 3 */
#define EIC_ICR_INT3                (0x1u << EIC_ICR_INT3_Pos)
#define   EIC_ICR_INT3_0            (0x0u <<  3) /**< \brief (EIC_ICR) No effect */
#define   EIC_ICR_INT3_1            (0x1u <<  3) /**< \brief (EIC_ICR) Clear Interrupt. */
#define EIC_ICR_INT4_Pos            4            /**< \brief (EIC_ICR) External Interrupt 4 */
#define EIC_ICR_INT4                (0x1u << EIC_ICR_INT4_Pos)
#define   EIC_ICR_INT4_0            (0x0u <<  4) /**< \brief (EIC_ICR) No effect */
#define   EIC_ICR_INT4_1            (0x1u <<  4) /**< \brief (EIC_ICR) Clear Interrupt. */
#define EIC_ICR_INT5_Pos            5            /**< \brief (EIC_ICR) External Interrupt 5 */
#define EIC_ICR_INT5                (0x1u << EIC_ICR_INT5_Pos)
#define EIC_ICR_INT6_Pos            6            /**< \brief (EIC_ICR) External Interrupt 6 */
#define EIC_ICR_INT6                (0x1u << EIC_ICR_INT6_Pos)
#define EIC_ICR_INT7_Pos            7            /**< \brief (EIC_ICR) External Interrupt 7 */
#define EIC_ICR_INT7                (0x1u << EIC_ICR_INT7_Pos)
#define EIC_ICR_INT8_Pos            8            /**< \brief (EIC_ICR) External Interrupt 8 */
#define EIC_ICR_INT8                (0x1u << EIC_ICR_INT8_Pos)
#define EIC_ICR_INT9_Pos            9            /**< \brief (EIC_ICR) External Interrupt 9 */
#define EIC_ICR_INT9                (0x1u << EIC_ICR_INT9_Pos)
#define EIC_ICR_INT10_Pos           10           /**< \brief (EIC_ICR) External Interrupt 10 */
#define EIC_ICR_INT10               (0x1u << EIC_ICR_INT10_Pos)
#define EIC_ICR_INT11_Pos           11           /**< \brief (EIC_ICR) External Interrupt 11 */
#define EIC_ICR_INT11               (0x1u << EIC_ICR_INT11_Pos)
#define EIC_ICR_INT12_Pos           12           /**< \brief (EIC_ICR) External Interrupt 12 */
#define EIC_ICR_INT12               (0x1u << EIC_ICR_INT12_Pos)
#define EIC_ICR_INT13_Pos           13           /**< \brief (EIC_ICR) External Interrupt 13 */
#define EIC_ICR_INT13               (0x1u << EIC_ICR_INT13_Pos)
#define EIC_ICR_INT14_Pos           14           /**< \brief (EIC_ICR) External Interrupt 14 */
#define EIC_ICR_INT14               (0x1u << EIC_ICR_INT14_Pos)
#define EIC_ICR_INT15_Pos           15           /**< \brief (EIC_ICR) External Interrupt 15 */
#define EIC_ICR_INT15               (0x1u << EIC_ICR_INT15_Pos)
#define EIC_ICR_MASK                0x0000FFFFu  /**< \brief (EIC_ICR) MASK Register */

/* -------- EIC_MODE : (EIC Offset: 0x014) (R/W 32) Mode Register -------- */
#define EIC_MODE_OFFSET             0x014        /**< \brief (EIC_MODE offset) Mode Register */
#define EIC_MODE_RESETVALUE         0x00000000   /**< \brief (EIC_MODE reset_value) Mode Register */

#define EIC_MODE_NMI_Pos            0            /**< \brief (EIC_MODE) External Non Maskable CPU interrupt */
#define EIC_MODE_NMI                (0x1u << EIC_MODE_NMI_Pos)
#define EIC_MODE_INT1_Pos           1            /**< \brief (EIC_MODE) External Interrupt 1 */
#define EIC_MODE_INT1               (0x1u << EIC_MODE_INT1_Pos)
#define   EIC_MODE_INT1_0           (0x0u <<  1) /**< \brief (EIC_MODE) Edge triggered interrupt */
#define   EIC_MODE_INT1_1           (0x1u <<  1) /**< \brief (EIC_MODE) Level triggered interrupt */
#define EIC_MODE_INT2_Pos           2            /**< \brief (EIC_MODE) External Interrupt 2 */
#define EIC_MODE_INT2               (0x1u << EIC_MODE_INT2_Pos)
#define   EIC_MODE_INT2_0           (0x0u <<  2) /**< \brief (EIC_MODE) Edge triggered interrupt */
#define   EIC_MODE_INT2_1           (0x1u <<  2) /**< \brief (EIC_MODE) Level triggered interrupt */
#define EIC_MODE_INT3_Pos           3            /**< \brief (EIC_MODE) External Interrupt 3 */
#define EIC_MODE_INT3               (0x1u << EIC_MODE_INT3_Pos)
#define   EIC_MODE_INT3_0           (0x0u <<  3) /**< \brief (EIC_MODE) Edge triggered interrupt */
#define   EIC_MODE_INT3_1           (0x1u <<  3) /**< \brief (EIC_MODE) Level triggered interrupt */
#define EIC_MODE_INT4_Pos           4            /**< \brief (EIC_MODE) External Interrupt 4 */
#define EIC_MODE_INT4               (0x1u << EIC_MODE_INT4_Pos)
#define   EIC_MODE_INT4_0           (0x0u <<  4) /**< \brief (EIC_MODE) Edge triggered interrupt */
#define   EIC_MODE_INT4_1           (0x1u <<  4) /**< \brief (EIC_MODE) Level triggered interrupt */
#define EIC_MODE_INT5_Pos           5            /**< \brief (EIC_MODE) External Interrupt 5 */
#define EIC_MODE_INT5               (0x1u << EIC_MODE_INT5_Pos)
#define EIC_MODE_INT6_Pos           6            /**< \brief (EIC_MODE) External Interrupt 6 */
#define EIC_MODE_INT6               (0x1u << EIC_MODE_INT6_Pos)
#define EIC_MODE_INT7_Pos           7            /**< \brief (EIC_MODE) External Interrupt 7 */
#define EIC_MODE_INT7               (0x1u << EIC_MODE_INT7_Pos)
#define EIC_MODE_INT8_Pos           8            /**< \brief (EIC_MODE) External Interrupt 8 */
#define EIC_MODE_INT8               (0x1u << EIC_MODE_INT8_Pos)
#define EIC_MODE_INT9_Pos           9            /**< \brief (EIC_MODE) External Interrupt 9 */
#define EIC_MODE_INT9               (0x1u << EIC_MODE_INT9_Pos)
#define EIC_MODE_INT10_Pos          10           /**< \brief (EIC_MODE) External Interrupt 10 */
#define EIC_MODE_INT10              (0x1u << EIC_MODE_INT10_Pos)
#define EIC_MODE_INT11_Pos          11           /**< \brief (EIC_MODE) External Interrupt 11 */
#define EIC_MODE_INT11              (0x1u << EIC_MODE_INT11_Pos)
#define EIC_MODE_INT12_Pos          12           /**< \brief (EIC_MODE) External Interrupt 12 */
#define EIC_MODE_INT12              (0x1u << EIC_MODE_INT12_Pos)
#define EIC_MODE_INT13_Pos          13           /**< \brief (EIC_MODE) External Interrupt 13 */
#define EIC_MODE_INT13              (0x1u << EIC_MODE_INT13_Pos)
#define EIC_MODE_INT14_Pos          14           /**< \brief (EIC_MODE) External Interrupt 14 */
#define EIC_MODE_INT14              (0x1u << EIC_MODE_INT14_Pos)
#define EIC_MODE_INT15_Pos          15           /**< \brief (EIC_MODE) External Interrupt 15 */
#define EIC_MODE_INT15              (0x1u << EIC_MODE_INT15_Pos)
#define EIC_MODE_MASK               0x0000FFFFu  /**< \brief (EIC_MODE) MASK Register */

/* -------- EIC_EDGE : (EIC Offset: 0x018) (R/W 32) Edge Register -------- */
#define EIC_EDGE_OFFSET             0x018        /**< \brief (EIC_EDGE offset) Edge Register */
#define EIC_EDGE_RESETVALUE         0x00000000   /**< \brief (EIC_EDGE reset_value) Edge Register */

#define EIC_EDGE_NMI_Pos            0            /**< \brief (EIC_EDGE) External Non Maskable CPU interrupt */
#define EIC_EDGE_NMI                (0x1u << EIC_EDGE_NMI_Pos)
#define EIC_EDGE_INT1_Pos           1            /**< \brief (EIC_EDGE) External Interrupt 1 */
#define EIC_EDGE_INT1               (0x1u << EIC_EDGE_INT1_Pos)
#define   EIC_EDGE_INT1_0           (0x0u <<  1) /**< \brief (EIC_EDGE) Triggers on falling edge */
#define   EIC_EDGE_INT1_1           (0x1u <<  1) /**< \brief (EIC_EDGE) Triggers on rising edge. */
#define EIC_EDGE_INT2_Pos           2            /**< \brief (EIC_EDGE) External Interrupt 2 */
#define EIC_EDGE_INT2               (0x1u << EIC_EDGE_INT2_Pos)
#define   EIC_EDGE_INT2_0           (0x0u <<  2) /**< \brief (EIC_EDGE) Triggers on falling edge */
#define   EIC_EDGE_INT2_1           (0x1u <<  2) /**< \brief (EIC_EDGE) Triggers on rising edge. */
#define EIC_EDGE_INT3_Pos           3            /**< \brief (EIC_EDGE) External Interrupt 3 */
#define EIC_EDGE_INT3               (0x1u << EIC_EDGE_INT3_Pos)
#define   EIC_EDGE_INT3_0           (0x0u <<  3) /**< \brief (EIC_EDGE) Triggers on falling edge */
#define   EIC_EDGE_INT3_1           (0x1u <<  3) /**< \brief (EIC_EDGE) Triggers on rising edge. */
#define EIC_EDGE_INT4_Pos           4            /**< \brief (EIC_EDGE) External Interrupt 4 */
#define EIC_EDGE_INT4               (0x1u << EIC_EDGE_INT4_Pos)
#define   EIC_EDGE_INT4_0           (0x0u <<  4) /**< \brief (EIC_EDGE) Triggers on falling edge */
#define   EIC_EDGE_INT4_1           (0x1u <<  4) /**< \brief (EIC_EDGE) Triggers on rising edge. */
#define EIC_EDGE_INT5_Pos           5            /**< \brief (EIC_EDGE) External Interrupt 5 */
#define EIC_EDGE_INT5               (0x1u << EIC_EDGE_INT5_Pos)
#define EIC_EDGE_INT6_Pos           6            /**< \brief (EIC_EDGE) External Interrupt 6 */
#define EIC_EDGE_INT6               (0x1u << EIC_EDGE_INT6_Pos)
#define EIC_EDGE_INT7_Pos           7            /**< \brief (EIC_EDGE) External Interrupt 7 */
#define EIC_EDGE_INT7               (0x1u << EIC_EDGE_INT7_Pos)
#define EIC_EDGE_INT8_Pos           8            /**< \brief (EIC_EDGE) External Interrupt 8 */
#define EIC_EDGE_INT8               (0x1u << EIC_EDGE_INT8_Pos)
#define EIC_EDGE_INT9_Pos           9            /**< \brief (EIC_EDGE) External Interrupt 9 */
#define EIC_EDGE_INT9               (0x1u << EIC_EDGE_INT9_Pos)
#define EIC_EDGE_INT10_Pos          10           /**< \brief (EIC_EDGE) External Interrupt 10 */
#define EIC_EDGE_INT10              (0x1u << EIC_EDGE_INT10_Pos)
#define EIC_EDGE_INT11_Pos          11           /**< \brief (EIC_EDGE) External Interrupt 11 */
#define EIC_EDGE_INT11              (0x1u << EIC_EDGE_INT11_Pos)
#define EIC_EDGE_INT12_Pos          12           /**< \brief (EIC_EDGE) External Interrupt 12 */
#define EIC_EDGE_INT12              (0x1u << EIC_EDGE_INT12_Pos)
#define EIC_EDGE_INT13_Pos          13           /**< \brief (EIC_EDGE) External Interrupt 13 */
#define EIC_EDGE_INT13              (0x1u << EIC_EDGE_INT13_Pos)
#define EIC_EDGE_INT14_Pos          14           /**< \brief (EIC_EDGE) External Interrupt 14 */
#define EIC_EDGE_INT14              (0x1u << EIC_EDGE_INT14_Pos)
#define EIC_EDGE_INT15_Pos          15           /**< \brief (EIC_EDGE) External Interrupt 15 */
#define EIC_EDGE_INT15              (0x1u << EIC_EDGE_INT15_Pos)
#define EIC_EDGE_MASK               0x0000FFFFu  /**< \brief (EIC_EDGE) MASK Register */

/* -------- EIC_LEVEL : (EIC Offset: 0x01C) (R/W 32) Level Register -------- */
#define EIC_LEVEL_OFFSET            0x01C        /**< \brief (EIC_LEVEL offset) Level Register */
#define EIC_LEVEL_RESETVALUE        0x00000000   /**< \brief (EIC_LEVEL reset_value) Level Register */

