Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_eic.h
#define EIC_LEVEL_NMI_Pos           0            /**< \brief (EIC_LEVEL) External Non Maskable CPU interrupt */
#define EIC_LEVEL_NMI               (0x1u << EIC_LEVEL_NMI_Pos)
#define EIC_LEVEL_INT1_Pos          1            /**< \brief (EIC_LEVEL) External Interrupt 1 */
#define EIC_LEVEL_INT1              (0x1u << EIC_LEVEL_INT1_Pos)
#define EIC_LEVEL_INT2_Pos          2            /**< \brief (EIC_LEVEL) External Interrupt 2 */
#define EIC_LEVEL_INT2              (0x1u << EIC_LEVEL_INT2_Pos)
#define EIC_LEVEL_INT3_Pos          3            /**< \brief (EIC_LEVEL) External Interrupt 3 */
#define EIC_LEVEL_INT3              (0x1u << EIC_LEVEL_INT3_Pos)
#define EIC_LEVEL_INT4_Pos          4            /**< \brief (EIC_LEVEL) External Interrupt 4 */
#define EIC_LEVEL_INT4              (0x1u << EIC_LEVEL_INT4_Pos)
#define EIC_LEVEL_INT5_Pos          5            /**< \brief (EIC_LEVEL) External Interrupt 5 */
#define EIC_LEVEL_INT5              (0x1u << EIC_LEVEL_INT5_Pos)
#define EIC_LEVEL_INT6_Pos          6            /**< \brief (EIC_LEVEL) External Interrupt 6 */
#define EIC_LEVEL_INT6              (0x1u << EIC_LEVEL_INT6_Pos)
#define EIC_LEVEL_INT7_Pos          7            /**< \brief (EIC_LEVEL) External Interrupt 7 */
#define EIC_LEVEL_INT7              (0x1u << EIC_LEVEL_INT7_Pos)
#define EIC_LEVEL_INT8_Pos          8            /**< \brief (EIC_LEVEL) External Interrupt 8 */
#define EIC_LEVEL_INT8              (0x1u << EIC_LEVEL_INT8_Pos)
#define EIC_LEVEL_INT9_Pos          9            /**< \brief (EIC_LEVEL) External Interrupt 9 */
#define EIC_LEVEL_INT9              (0x1u << EIC_LEVEL_INT9_Pos)
#define EIC_LEVEL_INT10_Pos         10           /**< \brief (EIC_LEVEL) External Interrupt 10 */
#define EIC_LEVEL_INT10             (0x1u << EIC_LEVEL_INT10_Pos)
#define EIC_LEVEL_INT11_Pos         11           /**< \brief (EIC_LEVEL) External Interrupt 11 */
#define EIC_LEVEL_INT11             (0x1u << EIC_LEVEL_INT11_Pos)
#define EIC_LEVEL_INT12_Pos         12           /**< \brief (EIC_LEVEL) External Interrupt 12 */
#define EIC_LEVEL_INT12             (0x1u << EIC_LEVEL_INT12_Pos)
#define EIC_LEVEL_INT13_Pos         13           /**< \brief (EIC_LEVEL) External Interrupt 13 */
#define EIC_LEVEL_INT13             (0x1u << EIC_LEVEL_INT13_Pos)
#define EIC_LEVEL_INT14_Pos         14           /**< \brief (EIC_LEVEL) External Interrupt 14 */
#define EIC_LEVEL_INT14             (0x1u << EIC_LEVEL_INT14_Pos)
#define EIC_LEVEL_INT15_Pos         15           /**< \brief (EIC_LEVEL) External Interrupt 15 */
#define EIC_LEVEL_INT15             (0x1u << EIC_LEVEL_INT15_Pos)
#define EIC_LEVEL_MASK              0x0000FFFFu  /**< \brief (EIC_LEVEL) MASK Register */

/* -------- EIC_FILTER : (EIC Offset: 0x020) (R/W 32) Filter Register -------- */
#define EIC_FILTER_OFFSET           0x020        /**< \brief (EIC_FILTER offset) Filter Register */
#define EIC_FILTER_RESETVALUE       0x00000000   /**< \brief (EIC_FILTER reset_value) Filter Register */

#define EIC_FILTER_NMI_Pos          0            /**< \brief (EIC_FILTER) External Non Maskable CPU interrupt */
#define EIC_FILTER_NMI              (0x1u << EIC_FILTER_NMI_Pos)
#define EIC_FILTER_INT1_Pos         1            /**< \brief (EIC_FILTER) External Interrupt 1 */
#define EIC_FILTER_INT1             (0x1u << EIC_FILTER_INT1_Pos)
#define EIC_FILTER_INT2_Pos         2            /**< \brief (EIC_FILTER) External Interrupt 2 */
#define EIC_FILTER_INT2             (0x1u << EIC_FILTER_INT2_Pos)
#define EIC_FILTER_INT3_Pos         3            /**< \brief (EIC_FILTER) External Interrupt 3 */
#define EIC_FILTER_INT3             (0x1u << EIC_FILTER_INT3_Pos)
#define EIC_FILTER_INT4_Pos         4            /**< \brief (EIC_FILTER) External Interrupt 4 */
#define EIC_FILTER_INT4             (0x1u << EIC_FILTER_INT4_Pos)
#define EIC_FILTER_INT5_Pos         5            /**< \brief (EIC_FILTER) External Interrupt 5 */
#define EIC_FILTER_INT5             (0x1u << EIC_FILTER_INT5_Pos)
#define EIC_FILTER_INT6_Pos         6            /**< \brief (EIC_FILTER) External Interrupt 6 */
#define EIC_FILTER_INT6             (0x1u << EIC_FILTER_INT6_Pos)
#define EIC_FILTER_INT7_Pos         7            /**< \brief (EIC_FILTER) External Interrupt 7 */
#define EIC_FILTER_INT7             (0x1u << EIC_FILTER_INT7_Pos)
#define EIC_FILTER_INT8_Pos         8            /**< \brief (EIC_FILTER) External Interrupt 8 */
#define EIC_FILTER_INT8             (0x1u << EIC_FILTER_INT8_Pos)
#define EIC_FILTER_INT9_Pos         9            /**< \brief (EIC_FILTER) External Interrupt 9 */
#define EIC_FILTER_INT9             (0x1u << EIC_FILTER_INT9_Pos)
#define EIC_FILTER_INT10_Pos        10           /**< \brief (EIC_FILTER) External Interrupt 10 */
#define EIC_FILTER_INT10            (0x1u << EIC_FILTER_INT10_Pos)
#define EIC_FILTER_INT11_Pos        11           /**< \brief (EIC_FILTER) External Interrupt 11 */
#define EIC_FILTER_INT11            (0x1u << EIC_FILTER_INT11_Pos)
#define EIC_FILTER_INT12_Pos        12           /**< \brief (EIC_FILTER) External Interrupt 12 */
#define EIC_FILTER_INT12            (0x1u << EIC_FILTER_INT12_Pos)
#define EIC_FILTER_INT13_Pos        13           /**< \brief (EIC_FILTER) External Interrupt 13 */
#define EIC_FILTER_INT13            (0x1u << EIC_FILTER_INT13_Pos)
#define EIC_FILTER_INT14_Pos        14           /**< \brief (EIC_FILTER) External Interrupt 14 */
#define EIC_FILTER_INT14            (0x1u << EIC_FILTER_INT14_Pos)
#define EIC_FILTER_INT15_Pos        15           /**< \brief (EIC_FILTER) External Interrupt 15 */
#define EIC_FILTER_INT15            (0x1u << EIC_FILTER_INT15_Pos)
#define EIC_FILTER_MASK             0x0000FFFFu  /**< \brief (EIC_FILTER) MASK Register */

/* -------- EIC_ASYNC : (EIC Offset: 0x028) (R/W 32) Asynchronous Register -------- */
#define EIC_ASYNC_OFFSET            0x028        /**< \brief (EIC_ASYNC offset) Asynchronous Register */
#define EIC_ASYNC_RESETVALUE        0x00000000   /**< \brief (EIC_ASYNC reset_value) Asynchronous Register */

#define EIC_ASYNC_NMI_Pos           0            /**< \brief (EIC_ASYNC) External Non Maskable CPU interrupt */
#define EIC_ASYNC_NMI               (0x1u << EIC_ASYNC_NMI_Pos)
#define EIC_ASYNC_INT1_Pos          1            /**< \brief (EIC_ASYNC) External Interrupt 1 */
#define EIC_ASYNC_INT1              (0x1u << EIC_ASYNC_INT1_Pos)
#define EIC_ASYNC_INT2_Pos          2            /**< \brief (EIC_ASYNC) External Interrupt 2 */
#define EIC_ASYNC_INT2              (0x1u << EIC_ASYNC_INT2_Pos)
#define EIC_ASYNC_INT3_Pos          3            /**< \brief (EIC_ASYNC) External Interrupt 3 */
#define EIC_ASYNC_INT3              (0x1u << EIC_ASYNC_INT3_Pos)
#define EIC_ASYNC_INT4_Pos          4            /**< \brief (EIC_ASYNC) External Interrupt 4 */
#define EIC_ASYNC_INT4              (0x1u << EIC_ASYNC_INT4_Pos)
#define EIC_ASYNC_INT5_Pos          5            /**< \brief (EIC_ASYNC) External Interrupt 5 */
#define EIC_ASYNC_INT5              (0x1u << EIC_ASYNC_INT5_Pos)
#define EIC_ASYNC_INT6_Pos          6            /**< \brief (EIC_ASYNC) External Interrupt 6 */
#define EIC_ASYNC_INT6              (0x1u << EIC_ASYNC_INT6_Pos)
#define EIC_ASYNC_INT7_Pos          7            /**< \brief (EIC_ASYNC) External Interrupt 7 */
#define EIC_ASYNC_INT7              (0x1u << EIC_ASYNC_INT7_Pos)
#define EIC_ASYNC_INT8_Pos          8            /**< \brief (EIC_ASYNC) External Interrupt 8 */
#define EIC_ASYNC_INT8              (0x1u << EIC_ASYNC_INT8_Pos)
#define EIC_ASYNC_INT9_Pos          9            /**< \brief (EIC_ASYNC) External Interrupt 9 */
#define EIC_ASYNC_INT9              (0x1u << EIC_ASYNC_INT9_Pos)
#define EIC_ASYNC_INT10_Pos         10           /**< \brief (EIC_ASYNC) External Interrupt 10 */
#define EIC_ASYNC_INT10             (0x1u << EIC_ASYNC_INT10_Pos)
#define EIC_ASYNC_INT11_Pos         11           /**< \brief (EIC_ASYNC) External Interrupt 11 */
#define EIC_ASYNC_INT11             (0x1u << EIC_ASYNC_INT11_Pos)
#define EIC_ASYNC_INT12_Pos         12           /**< \brief (EIC_ASYNC) External Interrupt 12 */
#define EIC_ASYNC_INT12             (0x1u << EIC_ASYNC_INT12_Pos)
#define EIC_ASYNC_INT13_Pos         13           /**< \brief (EIC_ASYNC) External Interrupt 13 */
#define EIC_ASYNC_INT13             (0x1u << EIC_ASYNC_INT13_Pos)
#define EIC_ASYNC_INT14_Pos         14           /**< \brief (EIC_ASYNC) External Interrupt 14 */
#define EIC_ASYNC_INT14             (0x1u << EIC_ASYNC_INT14_Pos)
#define EIC_ASYNC_INT15_Pos         15           /**< \brief (EIC_ASYNC) External Interrupt 15 */
#define EIC_ASYNC_INT15             (0x1u << EIC_ASYNC_INT15_Pos)
#define EIC_ASYNC_MASK              0x0000FFFFu  /**< \brief (EIC_ASYNC) MASK Register */

/* -------- EIC_EN : (EIC Offset: 0x030) ( /W 32) Enable Register -------- */
#define EIC_EN_OFFSET               0x030        /**< \brief (EIC_EN offset) Enable Register */
#define EIC_EN_RESETVALUE           0x00000000   /**< \brief (EIC_EN reset_value) Enable Register */

#define EIC_EN_NMI_Pos              0            /**< \brief (EIC_EN) External Non Maskable CPU interrupt */
#define EIC_EN_NMI                  (0x1u << EIC_EN_NMI_Pos)
#define EIC_EN_INT1_Pos             1            /**< \brief (EIC_EN) External Interrupt 1 */
#define EIC_EN_INT1                 (0x1u << EIC_EN_INT1_Pos)
#define EIC_EN_INT2_Pos             2            /**< \brief (EIC_EN) External Interrupt 2 */
#define EIC_EN_INT2                 (0x1u << EIC_EN_INT2_Pos)
#define EIC_EN_INT3_Pos             3            /**< \brief (EIC_EN) External Interrupt 3 */
#define EIC_EN_INT3                 (0x1u << EIC_EN_INT3_Pos)
#define EIC_EN_INT4_Pos             4            /**< \brief (EIC_EN) External Interrupt 4 */
#define EIC_EN_INT4                 (0x1u << EIC_EN_INT4_Pos)
#define EIC_EN_INT5_Pos             5            /**< \brief (EIC_EN) External Interrupt 5 */
#define EIC_EN_INT5                 (0x1u << EIC_EN_INT5_Pos)
#define EIC_EN_INT6_Pos             6            /**< \brief (EIC_EN) External Interrupt 6 */
#define EIC_EN_INT6                 (0x1u << EIC_EN_INT6_Pos)
#define EIC_EN_INT7_Pos             7            /**< \brief (EIC_EN) External Interrupt 7 */
#define EIC_EN_INT7                 (0x1u << EIC_EN_INT7_Pos)
#define EIC_EN_INT8_Pos             8            /**< \brief (EIC_EN) External Interrupt 8 */
#define EIC_EN_INT8                 (0x1u << EIC_EN_INT8_Pos)
#define EIC_EN_INT9_Pos             9            /**< \brief (EIC_EN) External Interrupt 9 */
#define EIC_EN_INT9                 (0x1u << EIC_EN_INT9_Pos)
#define EIC_EN_INT10_Pos            10           /**< \brief (EIC_EN) External Interrupt 10 */
#define EIC_EN_INT10                (0x1u << EIC_EN_INT10_Pos)
#define EIC_EN_INT11_Pos            11           /**< \brief (EIC_EN) External Interrupt 11 */
#define EIC_EN_INT11                (0x1u << EIC_EN_INT11_Pos)
#define EIC_EN_INT12_Pos            12           /**< \brief (EIC_EN) External Interrupt 12 */
#define EIC_EN_INT12                (0x1u << EIC_EN_INT12_Pos)
#define EIC_EN_INT13_Pos            13           /**< \brief (EIC_EN) External Interrupt 13 */
#define EIC_EN_INT13                (0x1u << EIC_EN_INT13_Pos)
#define EIC_EN_INT14_Pos            14           /**< \brief (EIC_EN) External Interrupt 14 */
#define EIC_EN_INT14                (0x1u << EIC_EN_INT14_Pos)
#define EIC_EN_INT15_Pos            15           /**< \brief (EIC_EN) External Interrupt 15 */
#define EIC_EN_INT15                (0x1u << EIC_EN_INT15_Pos)
#define EIC_EN_MASK                 0x0000FFFFu  /**< \brief (EIC_EN) MASK Register */

/* -------- EIC_DIS : (EIC Offset: 0x034) ( /W 32) Disable Register -------- */
#define EIC_DIS_OFFSET              0x034        /**< \brief (EIC_DIS offset) Disable Register */
#define EIC_DIS_RESETVALUE          0x00000000   /**< \brief (EIC_DIS reset_value) Disable Register */

