Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_eic.h
#define EIC_DIS_NMI_Pos             0            /**< \brief (EIC_DIS) External Non Maskable CPU interrupt */
#define EIC_DIS_NMI                 (0x1u << EIC_DIS_NMI_Pos)
#define EIC_DIS_INT1_Pos            1            /**< \brief (EIC_DIS) External Interrupt 1 */
#define EIC_DIS_INT1                (0x1u << EIC_DIS_INT1_Pos)
#define EIC_DIS_INT2_Pos            2            /**< \brief (EIC_DIS) External Interrupt 2 */
#define EIC_DIS_INT2                (0x1u << EIC_DIS_INT2_Pos)
#define EIC_DIS_INT3_Pos            3            /**< \brief (EIC_DIS) External Interrupt 3 */
#define EIC_DIS_INT3                (0x1u << EIC_DIS_INT3_Pos)
#define EIC_DIS_INT4_Pos            4            /**< \brief (EIC_DIS) External Interrupt 4 */
#define EIC_DIS_INT4                (0x1u << EIC_DIS_INT4_Pos)
#define EIC_DIS_INT5_Pos            5            /**< \brief (EIC_DIS) External Interrupt 5 */
#define EIC_DIS_INT5                (0x1u << EIC_DIS_INT5_Pos)
#define EIC_DIS_INT6_Pos            6            /**< \brief (EIC_DIS) External Interrupt 6 */
#define EIC_DIS_INT6                (0x1u << EIC_DIS_INT6_Pos)
#define EIC_DIS_INT7_Pos            7            /**< \brief (EIC_DIS) External Interrupt 7 */
#define EIC_DIS_INT7                (0x1u << EIC_DIS_INT7_Pos)
#define EIC_DIS_INT8_Pos            8            /**< \brief (EIC_DIS) External Interrupt 8 */
#define EIC_DIS_INT8                (0x1u << EIC_DIS_INT8_Pos)
#define EIC_DIS_INT9_Pos            9            /**< \brief (EIC_DIS) External Interrupt 9 */
#define EIC_DIS_INT9                (0x1u << EIC_DIS_INT9_Pos)
#define EIC_DIS_INT10_Pos           10           /**< \brief (EIC_DIS) External Interrupt 10 */
#define EIC_DIS_INT10               (0x1u << EIC_DIS_INT10_Pos)
#define EIC_DIS_INT11_Pos           11           /**< \brief (EIC_DIS) External Interrupt 11 */
#define EIC_DIS_INT11               (0x1u << EIC_DIS_INT11_Pos)
#define EIC_DIS_INT12_Pos           12           /**< \brief (EIC_DIS) External Interrupt 12 */
#define EIC_DIS_INT12               (0x1u << EIC_DIS_INT12_Pos)
#define EIC_DIS_INT13_Pos           13           /**< \brief (EIC_DIS) External Interrupt 13 */
#define EIC_DIS_INT13               (0x1u << EIC_DIS_INT13_Pos)
#define EIC_DIS_INT14_Pos           14           /**< \brief (EIC_DIS) External Interrupt 14 */
#define EIC_DIS_INT14               (0x1u << EIC_DIS_INT14_Pos)
#define EIC_DIS_INT15_Pos           15           /**< \brief (EIC_DIS) External Interrupt 15 */
#define EIC_DIS_INT15               (0x1u << EIC_DIS_INT15_Pos)
#define EIC_DIS_MASK                0x0000FFFFu  /**< \brief (EIC_DIS) MASK Register */

/* -------- EIC_CTRL : (EIC Offset: 0x038) (R/  32) Control Register -------- */
#define EIC_CTRL_OFFSET             0x038        /**< \brief (EIC_CTRL offset) Control Register */
#define EIC_CTRL_RESETVALUE         0x00000000   /**< \brief (EIC_CTRL reset_value) Control Register */

#define EIC_CTRL_NMI_Pos            0            /**< \brief (EIC_CTRL) External Non Maskable CPU interrupt */
#define EIC_CTRL_NMI                (0x1u << EIC_CTRL_NMI_Pos)
#define EIC_CTRL_INT1_Pos           1            /**< \brief (EIC_CTRL) External Interrupt 1 */
#define EIC_CTRL_INT1               (0x1u << EIC_CTRL_INT1_Pos)
#define EIC_CTRL_INT2_Pos           2            /**< \brief (EIC_CTRL) External Interrupt 2 */
#define EIC_CTRL_INT2               (0x1u << EIC_CTRL_INT2_Pos)
#define EIC_CTRL_INT3_Pos           3            /**< \brief (EIC_CTRL) External Interrupt 3 */
#define EIC_CTRL_INT3               (0x1u << EIC_CTRL_INT3_Pos)
#define EIC_CTRL_INT4_Pos           4            /**< \brief (EIC_CTRL) External Interrupt 4 */
#define EIC_CTRL_INT4               (0x1u << EIC_CTRL_INT4_Pos)
#define EIC_CTRL_INT5_Pos           5            /**< \brief (EIC_CTRL) External Interrupt 5 */
#define EIC_CTRL_INT5               (0x1u << EIC_CTRL_INT5_Pos)
#define EIC_CTRL_INT6_Pos           6            /**< \brief (EIC_CTRL) External Interrupt 6 */
#define EIC_CTRL_INT6               (0x1u << EIC_CTRL_INT6_Pos)
#define EIC_CTRL_INT7_Pos           7            /**< \brief (EIC_CTRL) External Interrupt 7 */
#define EIC_CTRL_INT7               (0x1u << EIC_CTRL_INT7_Pos)
#define EIC_CTRL_INT8_Pos           8            /**< \brief (EIC_CTRL) External Interrupt 8 */
#define EIC_CTRL_INT8               (0x1u << EIC_CTRL_INT8_Pos)
#define EIC_CTRL_INT9_Pos           9            /**< \brief (EIC_CTRL) External Interrupt 9 */
#define EIC_CTRL_INT9               (0x1u << EIC_CTRL_INT9_Pos)
#define EIC_CTRL_INT10_Pos          10           /**< \brief (EIC_CTRL) External Interrupt 10 */
#define EIC_CTRL_INT10              (0x1u << EIC_CTRL_INT10_Pos)
#define EIC_CTRL_INT11_Pos          11           /**< \brief (EIC_CTRL) External Interrupt 11 */
#define EIC_CTRL_INT11              (0x1u << EIC_CTRL_INT11_Pos)
#define EIC_CTRL_INT12_Pos          12           /**< \brief (EIC_CTRL) External Interrupt 12 */
#define EIC_CTRL_INT12              (0x1u << EIC_CTRL_INT12_Pos)
#define EIC_CTRL_INT13_Pos          13           /**< \brief (EIC_CTRL) External Interrupt 13 */
#define EIC_CTRL_INT13              (0x1u << EIC_CTRL_INT13_Pos)
#define EIC_CTRL_INT14_Pos          14           /**< \brief (EIC_CTRL) External Interrupt 14 */
#define EIC_CTRL_INT14              (0x1u << EIC_CTRL_INT14_Pos)
#define EIC_CTRL_INT15_Pos          15           /**< \brief (EIC_CTRL) External Interrupt 15 */
#define EIC_CTRL_INT15              (0x1u << EIC_CTRL_INT15_Pos)
#define EIC_CTRL_MASK               0x0000FFFFu  /**< \brief (EIC_CTRL) MASK Register */

/* -------- EIC_VERSION : (EIC Offset: 0x3FC) (R/  32) Version Register -------- */
#define EIC_VERSION_OFFSET          0x3FC        /**< \brief (EIC_VERSION offset) Version Register */
#define EIC_VERSION_RESETVALUE      0x00000302   /**< \brief (EIC_VERSION reset_value) Version Register */

#define EIC_VERSION_VERSION_Pos     0            /**< \brief (EIC_VERSION) Version bits */
#define EIC_VERSION_VERSION_Msk     (0xFFFu << EIC_VERSION_VERSION_Pos)
#define EIC_VERSION_VERSION(value)  ((EIC_VERSION_VERSION_Msk & ((value) << EIC_VERSION_VERSION_Pos)))
#define EIC_VERSION_MASK            0x00000FFFu  /**< \brief (EIC_VERSION) MASK Register */

