Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_eic.h
/** \brief EIC hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  WoReg   EIC_IER;            /**< \brief (EIC Offset: 0x000) Interrupt Enable Register */
  WoReg   EIC_IDR;            /**< \brief (EIC Offset: 0x004) Interrupt Disable Register */
  RoReg   EIC_IMR;            /**< \brief (EIC Offset: 0x008) Interrupt Mask Register */
  RoReg   EIC_ISR;            /**< \brief (EIC Offset: 0x00C) Interrupt Status Register */
  WoReg   EIC_ICR;            /**< \brief (EIC Offset: 0x010) Interrupt Clear Register */
  RwReg   EIC_MODE;           /**< \brief (EIC Offset: 0x014) Mode Register */
  RwReg   EIC_EDGE;           /**< \brief (EIC Offset: 0x018) Edge Register */
  RwReg   EIC_LEVEL;          /**< \brief (EIC Offset: 0x01C) Level Register */
  RwReg   EIC_FILTER;         /**< \brief (EIC Offset: 0x020) Filter Register */
  RoReg8  Reserved1[0x4];
  RwReg   EIC_ASYNC;          /**< \brief (EIC Offset: 0x028) Asynchronous Register */
  RoReg8  Reserved2[0x4];
  WoReg   EIC_EN;             /**< \brief (EIC Offset: 0x030) Enable Register */
  WoReg   EIC_DIS;            /**< \brief (EIC Offset: 0x034) Disable Register */
  RoReg   EIC_CTRL;           /**< \brief (EIC Offset: 0x038) Control Register */
  RoReg8  Reserved3[0x3C0];
  RoReg   EIC_VERSION;        /**< \brief (EIC Offset: 0x3FC) Version Register */
} Eic;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_EIC_COMPONENT_ */
